Wikitutorials/tutorials/multiphase/multiphaseEulerFoam/laminar/titaniaSynthesisSurface/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default     Euler;
}

gradSchemes
{
    default     Gauss linear;
    limited     cellLimited Gauss linear 1;
}

divSchemes
{
    default                                 none;

    "div\(phi,alpha.*\)"                    Gauss vanLeer;
    "div\(phir,alpha.*\)"                   Gauss vanLeer;

    "div\(alphaRhoPhi.*,U.*\)"              Gauss limitedLinearV 1;
    "div\(phi.*,U.*\)"                      Gauss limitedLinearV 1;

    "div\(alphaRhoPhi.*,(k|epsilon|h|e).*\)"          Gauss limitedLinear 1;
    "div\(alphaRhoPhi.*,K.*\)"              Gauss limitedLinear 1;
    "div\(alphaRhoPhi.*,Y.*\)"              Gauss limitedLinear 1;
    "div\(alphaPhi.*,p\)"                   Gauss limitedLinear 1;

    "div\(alphaRhoPhi.*,f.*\)"              Gauss upwind;
    "div\(fAlphaRhoPhi.*,kappa.*\)"         Gauss linearUpwind limited;

    "div\(\(\(\(alpha.*\*thermo:rho.*\)\*nuEff.*\)\*dev2\(T\(grad\(U.*\)\)\)\)\)" Gauss linear;
}

laplacianSchemes
{
    default     Gauss linear corrected;
}

interpolationSchemes
{
    default     linear;

    fi          upwind alphaRhoPhi.particles;
}

snGradSchemes
{
    default    corrected;
}

// ************************************************************************* //
